{
  "numerology_data": {
    "1": {
      "planet": "सूर्य (Sun)",
      "planet_english": "Sun",
      "positive_aspects": [
        "काम के लिए उपयुक्त - महत्वपूर्ण कामों के लिए आदर्श, जैसे सरकारी काम, जंगलों में काम",
        "नेतृत्व क्षमता - महत्वपूर्ण निर्णय लेने और काम को सफलतापूर्वक पूरा करने में सहायक"
      ],
      "negative_aspects": [
        "अहंकार - सफलता में मदद कर सकता है लेकिन रिश्तों में समस्या पैदा कर सकता है",
        "आत्मविश्वास और गर्व - कभी-कभी अहंकार में बदल सकता है"
      ],
      "advice": "नेतृत्व क्षमता और आत्मविश्वास का उपयोग करें, लेकिन अहंकार और गर्व को नियंत्रित रखें",
      "suitable_for": "सरकारी काम, महत्वपूर्ण परियोजनाएं, जंगलों में काम"
    },
    "2": {
      "planet": "चंद्रमा (Moon)",
      "planet_english": "Moon",
      "positive_aspects": [
        "छोटे कामों के लिए उपयुक्त - छोटे ट्रिप, पिकनिक, दैनिक यात्राएं",
        "लचीलापन - विभिन्न स्थितियों में आसानी से अनुकूल होने में सहायक"
      ],
      "negative_aspects": [
        "भावुकता - गाड़ी चलाते समय भावुक हो सकते हैं, गति बढ़ने और एक्सीडेंट का खतरा",
        "अधिक तनाव - चिंता और तनाव से ड्राइविंग क्षमता प्रभावित हो सकती है"
      ],
      "advice": "शांत और संयमित रहें, अधिक सोचने से बचें, सुरक्षित ड्राइविंग का पालन करें",
      "suitable_for": "छोटे ट्रिप, पिकनिक, दैनिक यात्राएं"
    },
    "3": {
      "planet": "बृहस्पति (Jupiter)",
      "planet_english": "Jupiter",
      "positive_aspects": [
        "राजनीतिक और प्रशासनिक काम - नेताओं और उच्च पदस्थ अधिकारियों के लिए उपयुक्त",
        "प्रभावशाली उपस्थिति - सार्वजनिक जीवन में सफलता प्राप्त करने में सहायक"
      ],
      "negative_aspects": [
        "अत्यधिक गर्व - संपत्ति और शक्ति का प्रदर्शन करने की प्रवृत्ति",
        "दिखावा - आत्म-प्रदर्शन जो दूसरों को पसंद नहीं आ सकता"
      ],
      "advice": "गर्व और दिखावे को नियंत्रित रखें ताकि सार्वजनिक छवि बनी रहे",
      "suitable_for": "राजनीतिक नेता, उच्च पदस्थ अधिकारी, रैलियां, सार्वजनिक कार्यक्रम"
    },
    "4": {
      "planet": "राहु (Rahu)",
      "planet_english": "Rahu",
      "positive_aspects": [
        "अचानक पैसा आने का रास्ता - व्यवसायिक सफलता के लिए उपयुक्त",
        "व्यवसायिक सफलता - गाड़ी को साफ-सुथरा रखने से वित्तीय लाभ"
      ],
      "negative_aspects": [
        "गलत निर्णय - व्यवसायिक और व्यक्तिगत जीवन पर नकारात्मक प्रभाव",
        "वित्तीय नुकसान - गलत निर्णयों से समस्याएं उत्पन्न हो सकती हैं"
      ],
      "advice": "ध्यान केंद्रित रखें, रास्ते पर ही ध्यान दें, अधिक सोचने और गलत विचारों से बचें",
      "suitable_for": "व्यवसायिक गतिविधियां, नए अवसरों की तलाश"
    },
    "5": {
      "planet": "बुध (Mercury)",
      "planet_english": "Mercury",
      "positive_aspects": [
        "व्यवसाय और कामकाज - व्यवसायिक गतिविधियों के लिए अत्यधिक उपयुक्त",
        "नए अवसरों की तलाश - व्यवसायिक सफलता में सहायक"
      ],
      "negative_aspects": [
        "छोटे बच्चों की तरह बातें करना - कामकाज में व्यवधान और रिश्तों पर नकारात्मक प्रभाव",
        "विचलित करने वाला व्यवहार - दूसरों के लिए परेशानी का कारण"
      ],
      "advice": "अधिक बात करने से बचें, ध्यान केंद्रित रखें, अनुशासन और संयम बनाए रखें",
      "suitable_for": "व्यवसायिक गतिविधियां, कामकाज, व्यापार"
    },
    "6": {
      "planet": "शुक्र (Venus)",
      "planet_english": "Venus",
      "positive_aspects": [
        "प्रदर्शन और आर्टिस्टिक कार्य - फिल्में, फैशन शो के लिए उपयुक्त",
        "रचनात्मक और कलात्मक गतिविधियां - कलाकारों के लिए आदर्श"
      ],
      "negative_aspects": [
        "महिलाओं की ओर अधिक आकर्षण - व्यक्तिगत और पेशेवर जिंदगी पर नकारात्मक प्रभाव",
        "अत्यधिक शराब पीने की प्रवृत्ति - जीवन पर हानिकारक प्रभाव"
      ],
      "advice": "आवेगों पर नियंत्रण रखें, संतुलित जीवन जिएं, शराब और आकर्षण को नियंत्रित करें",
      "suitable_for": "सिनेमा, आर्टिस्टिक काम, फैशन शो, रचनात्मक कार्य"
    },
    "7": {
      "planet": "केतु (Ketu)",
      "planet_english": "Ketu",
      "positive_aspects": [
        "आध्यात्मिक सोच - आध्यात्मिक यात्रा और तीर्थ स्थानों के लिए उपयुक्त",
        "धार्मिक यात्रा - मंदिरों और तीर्थ स्थानों की यात्रा के लिए आदर्श"
      ],
      "negative_aspects": [
        "भौतिक वस्तुओं से दूरी - भौतिक चीजों से अधिक लगाव नहीं होता",
        "अस्थायित्व की समझ - सभी वस्तुओं को अस्थायी मानते हैं, अधिक आसक्त नहीं होते"
      ],
      "advice": "आध्यात्मिक सोच और अस्थायित्व की समझ के साथ आगे बढ़ें",
      "suitable_for": "आध्यात्मिक यात्रा, तीर्थ यात्रा, धार्मिक कार्य"
    },
    "8": {
      "planet": "शनि (Saturn)",
      "planet_english": "Saturn",
      "positive_aspects": [
        "सामुदायिक कार्य - सामाजिक और सामुदायिक गतिविधियों में उत्कृष्ट",
        "लोकतांत्रिक गतिविधियां - सामाजिक परिवर्तन और सामुदायिक विकास में प्रभावी"
      ],
      "negative_aspects": [
        "अधिक प्रयास और कम वित्तीय लाभ - मेहनत अधिक, पैसा कम",
        "वित्तीय अपेक्षाओं की पूर्ति नहीं - आर्थिक लाभ की उम्मीद न करें"
      ],
      "advice": "उद्देश्यों को स्पष्ट करें, वित्तीय लाभ की अपेक्षा न रखें, रणनीति में समायोजन करें",
      "suitable_for": "सामुदायिक कार्य, सामाजिक सेवा, घरेलू कार्य"
    },
    "9": {
      "planet": "मंगल (Mars)",
      "planet_english": "Mars",
      "positive_aspects": [
        "जल्दी सोचने और निर्णय लेने की क्षमता - तेज निर्णय लेने वालों के लिए उपयुक्त",
        "सक्रियता - तेजी से काम करने वालों के लिए आदर्श"
      ],
      "negative_aspects": [
        "अत्यधिक गति से गाड़ी चलाना - दुर्घटना का खतरा बढ़ता है",
        "सुरक्षा पर नकारात्मक प्रभाव - खतरनाक ड्राइविंग की प्रवृत्ति"
      ],
      "advice": "शांति और सावधानी से चलाएं, धैर्य रखें, अधिक सोचने से बचें, ध्यान केंद्रित रखें",
      "suitable_for": "तेज निर्णय लेने वाले, सक्रिय व्यक्तित्व वाले लोग"
    }
  },
  "alphabet_to_number": {
    "1": ["a", "i", "j", "q", "y"],
    "2": ["b", "k", "r"],
    "3": ["c", "g", "l", "s"],
    "4": ["d", "m", "t"],
    "5": ["e", "h", "n", "x"],
    "6": ["u", "v", "w"],
    "7": ["o", "z"],
    "8": ["f", "p"]
  },
  "calculation_info": {
    "method": "Add all digits in the vehicle number until you get a single digit (1-9)",
    "example": "For vehicle number 1234: 1+2+3+4 = 10, then 1+0 = 1"
  }
}